### Loading the Character dataset

In [2]:
# imports my code from the file src/data/movies_char_data.py
import src.data.movies_char_data as MovieChar

In [3]:
character_df = MovieChar.CharacterData("Character", "character.metadata.tsv", output_name = "character_data_clean.csv")
character_df.raw_df.head()

Checking if the data is loaded from a file or from memory
Character : Loading the raw data in the attribute
data/raw/character.metadata.tsv
Character : loaded 450668 rows !

,975900,/m/03vyhn,2001-08-24,Akooshay,1958-08-26,F,1.62,Unnamed: 7,Wanda De Jesus,42,/m/0bgchxw,/m/0bgcj3x,/m/03wcfv7
0,975900,/m/03vyhn,2001-08-24,Lieutenant Melanie Ballard,1974-08-15,F,1.780,/m/044038p,Natasha Henstridge,27.0,/m/0jys3m,/m/0bgchn4,/m/0346l4
1,975900,/m/03vyhn,2001-08-24,Desolation Williams,1969-06-15,M,1.727,/m/0x67,Ice Cube,32.0,/m/0jys3g,/m/0bgchn_,/m/01vw26l
2,975900,/m/03vyhn,2001-08-24,Sgt Jericho Butler,1967-09-12,M,1.750,NaN,Jason Statham,33.0,/m/02vchl6,/m/0bgchnq,/m/034hyc
3,975900,/m/03vyhn,2001-08-24,Bashira Kincaid,1977-09-25,F,1.650,NaN,Clea DuVall,23.0,/m/02vbb3r,/m/0bgchp9,/m/01y9xg
4,975900,/m/03vyhn,2001-08-24,Commander Helena Braddock,1949-05-26,F,1.727,/m/0x67,Pam Grier,52.0,/m/02vdcfp,/m/0bgchnd,/m/0418ft

In [4]:
# print duplicated rows
character_df.clean_raw_data()
character_df.clean_df.head()

Character : Cleaning the raw data

,Wikipedia_movie_ID,Release_date,Character_name,Actor_DOB,Actor_gender,Actor_height,Actor_ethnicity,Actor_name,Actor_age
0,975900,2001-08-24,Lieutenant Melanie Ballard,1974-08-15,F,1.780,/m/044038p,Natasha Henstridge,27.0
1,975900,2001-08-24,Desolation Williams,1969-06-15,M,1.727,/m/0x67,Ice Cube,32.0
2,975900,2001-08-24,Sgt Jericho Butler,1967-09-12,M,1.750,NaN,Jason Statham,33.0
3,975900,2001-08-24,Bashira Kincaid,1977-09-25,F,1.650,NaN,Clea DuVall,23.0
4,975900,2001-08-24,Commander Helena Braddock,1949-05-26,F,1.727,/m/0x67,Pam Grier,52.0

In [5]:
character_df.pipeline()

Character : Loading the raw data in the attribute
data/raw/character.metadata.tsv
Character : loaded 450668 rows !
Character : Cleaning the raw data
Character : Data has been cleaned and saved to data/clean/movies_char/character.metadata.tsv!

#### Loading the Movie dataset

In [6]:
movie_df = MovieChar.MovieData("Movie", "movie.metadata.tsv", output_name = "movie_data_clean.csv")

#Display name and file_name
print(movie_df.name, movie_df.file_name)

movie_df.raw_df.head()

Checking if the data is loaded from a file or from memory
Movie : Loading the raw data in the attribute
data/raw/movie.metadata.tsv
Movie : loaded 81740 rows !
Movie movie.metadata.tsv

,975900,/m/03vyhn,Ghosts of Mars,2001-08-24,14010832,98.0,"{""/m/02h40lc"": ""English Language""}","{""/m/09c7w0"": ""United States of America""}","{""/m/01jfsb"": ""Thriller"", ""/m/06n90"": ""Science Fiction"", ""/m/03npn"": ""Horror"", ""/m/03k9fj"": ""Adventure"", ""/m/0fdjb"": ""Supernatural"", ""/m/02kdv5l"": ""Action"", ""/m/09zvmj"": ""Space western""}"
0,3196793,/m/08yl5d,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,95.0,"{""/m/02h40lc"": ""English Language""}","{""/m/09c7w0"": ""United States of America""}","{""/m/02n4kr"": ""Mystery"", ""/m/03bxz7"": ""Biograp..."
1,28463795,/m/0crgdbh,Brun bitter,1988,NaN,83.0,"{""/m/05f_3"": ""Norwegian Language""}","{""/m/05b4w"": ""Norway""}","{""/m/0lsxr"": ""Crime Fiction"", ""/m/07s9rl0"": ""D..."
2,9363483,/m/0285_cd,White Of The Eye,1987,NaN,110.0,"{""/m/02h40lc"": ""English Language""}","{""/m/07ssc"": ""United Kingdom""}","{""/m/01jfsb"": ""Thriller"", ""/m/0glj9q"": ""Erotic..."
3,261236,/m/01mrr1,A Woman in Flames,1983,NaN,106.0,"{""/m/04306rv"": ""German Language""}","{""/m/0345h"": ""Germany""}","{""/m/07s9rl0"": ""Drama""}"
4,13696889,/m/03cfc81,The Gangsters,1913-05-29,NaN,35.0,"{""/m/06ppq"": ""Silent film"", ""/m/02h40lc"": ""Eng...","{""/m/09c7w0"": ""United States of America""}","{""/m/02hmvc"": ""Short Film"", ""/m/06ppq"": ""Silen..."

In [7]:
# print duplicated rows
movie_df.clean_raw_data()
movie_df.clean_df.head()

,Wikipedia_movie_ID,Movie_name,Release_date,Revenue,Runtime,Languages,Countries,Genres
0,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama"
1,28463795,Brun bitter,NaT,NaN,0 days 00:00:00.000000083,Norwegian,Norway,"Crime Fiction, Drama"
2,9363483,White Of The Eye,NaT,NaN,0 days 00:00:00.000000110,English,United Kingdom,"Thriller, Erotic thriller, Psychological thriller"
3,261236,A Woman in Flames,NaT,NaN,0 days 00:00:00.000000106,German,Germany,Drama
4,13696889,The Gangsters,1913-05-29,NaN,0 days 00:00:00.000000035,"Silent film, English",United States of America,"Short Film, Silent film, Indie, Black-and-whit..."

In [8]:
movie_df.pipeline()

Movie : Loading the raw data in the attribute
data/raw/movie.metadata.tsv
Movie : loaded 81740 rows !
Movie : Data has been cleaned and saved to data/clean/movies_char/movie.metadata.tsv!

### Merging into 1 big dataset

In [9]:
from src.utils.names_utils import *

mov_char_data = merge_movies_characters_data(movie_df, character_df)

mov_char_data().head() # When we call the data name object, it returns the cleaned data

Wikipedia_movie_ID              int64
Movie_name                     object
Release_date           datetime64[ns]
Revenue                       float64
Runtime               timedelta64[ns]
Languages                      object
Countries                      object
Genres                         object
Character_name                 object
Actor_DOB              datetime64[ns]
Actor_gender                   object
Actor_height                  float64
Actor_ethnicity                object
Actor_name                     object
Actor_age                     float64
dtype: object
Duplicates found:
        Wikipedia_movie_ID       Movie_name Release_date  Revenue  \
219               29528534    Anokha Rishta          NaT      NaN
1283              30405742      Plug & Pray          NaT      NaN
1521              32148709  Dhan Dhana Dhan   2011-06-24      NaN
2410               4058835      Boot Polish          NaT      NaN
2460              25019575    Tanging Yaman          NaT      NaN
...                    ...              ...          ...      ...
446984            28417976  Bollywood Queen   2002-12-11      NaN
448802            27670970           Loaded   2008-03-25      NaN
448807            27670970           Loaded   2008-03-25      NaN
448808            27670970           Loaded   2008-03-25      NaN
448809            27670970           Loaded   2008-03-25      NaN

                         Runtime                            Languages  \
219    0 days 00:00:00.000000180                                Hindi
1283   0 days 00:00:00.000000091   Japanese, Italian, German, English
1521                         NaT
2410   0 days 00:00:00.000000148                                Hindi
2460   0 days 00:00:00.000000120  Tagalog language, Filipino language
...                          ...                                  ...
446984 0 days 00:00:00.000000086                       Hindi, English
448802 0 days 00:00:00.000000085                              English
448807 0 days 00:00:00.000000085                              English
448808 0 days 00:00:00.000000085                              English
448809 0 days 00:00:00.000000085                              English

                       Countries  \
219                        India
1283                     Germany
1521
2410                       India
2460                 Philippines
...                          ...
446984            United Kingdom
448802  United States of America
448807  United States of America
448808  United States of America
448809  United States of America

                                                   Genres Character_name  \
219     World cinema, Musical, Drama, Romantic drama, ...    Dr. Pramila
1283           Science Fiction, World cinema, Documentary            NaN
1521                            Comedy film, Romance Film            NaN
2410              Musical, Drama, World cinema, Bollywood           John
2460                 Drama, Filipino Movies, World cinema            NaN
...                                                   ...            ...
446984       Romantic drama, Musical, Drama, Romance Film            Jay
448802  Thriller, Crime Fiction, Action/Adventure, Dra...  Tristan Price
448807  Thriller, Crime Fiction, Action/Adventure, Dra...            NaN
448808  Thriller, Crime Fiction, Action/Adventure, Dra...            NaN
448809  Thriller, Crime Fiction, Action/Adventure, Dra...            NaN

        Actor_DOB Actor_gender  Actor_height Actor_ethnicity  \
219    1955-10-17            F           NaN       /m/0cqgdq
1283          NaT          NaN           NaN             NaN
1521          NaT            M           NaN             NaN
2410          NaT            M           NaN       /m/04zjjt
2460          NaT          NaN           NaN             NaN
...           ...          ...           ...             ...
446984 1979-04-21            M         1.700       /m/03lmx1
448802 1978-12-09            M         1.772       /m/06v41q
448807        NaT          NaN           NaN             NaN
448808        NaT          NaN           NaN             NaN
448809        NaT          NaN           NaN             NaN

                    Actor_name  Actor_age
219                Smita Patil       30.0
1283                       NaN        NaN
1521                Prem Kumar        NaN
2410    David Abraham Cheulkar       44.0
2460                       NaN        NaN
...                        ...        ...
446984            James McAvoy       23.0
448802          Jesse Metcalfe       29.0
448807                     NaN        NaN
448808                     NaN        NaN
448809                     NaN        NaN

[862 rows x 15 columns]

,Wikipedia_movie_ID,Movie_name,Release_date,Revenue,Runtime,Languages,Countries,Genres,Character_name,Actor_DOB,Actor_gender,Actor_height,Actor_ethnicity,Actor_name,Actor_age
0,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",Police Officer,NaT,M,NaN,NaN,Allen Cutler,NaN
1,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",Reporter,1956-12-19,F,NaN,NaN,Alice Barrett,43.0
2,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",NaN,NaT,M,NaN,NaN,Rod Britt,NaN
3,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",NaN,NaT,F,NaN,NaN,Hildy Brooks,NaN
4,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 00:00:00.000000095,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",FBI Profiler Robert Hanks,1950-01-05,M,NaN,NaN,Robert Catrini,50.0

In [10]:
# Print size of the dataset
print(mov_char_data().shape)

(449790, 15)

# Names datasets

In order to answer our research questions, we needed to find some birth registries from different countries. Those were freely available and we found datasets for the following countries:

- France
- USA
- United Kingdom
- AJOUTER AUTRE SI BESOIN

Since they all came from different places and didn't follow the same structure, we had to decide what kind of data was necessary for our project and what structure would be the most practical to work with. We ended-up with the following collumns in our dataframes:

1. **Year** : An integer value giving the year of the count 
2. **Name** :  A string representing the name that was counted
3. **Sex** : There are two possible characters, 'F' (female) and 'M' (male)
4. **Count** : An integer value giving the count of the name during this year

## Data homogenization

Thhe cleaning task was implement in the *clean_raw_data()* method of our different NamesData classes implementation (by country) and validated using the *check_clean_data()* method, available and shared by all the name datasets (python inheritance).

### Column structure
This task was not too difficult since it was mostly reordering, renaming the ones needed and dropping the ones that were not useful for our project. We also made sure that the same type was used on the collumns of the different datasets. 

### Year 
All of our dataset had the same year format, but some had missing values in this field, which made those row useless and they were therefore discarded.
This collumn made it hard to find datasets from more countries, since a lot of them started to count only in the early 2000's, which doesn't give us enough data to detect real changes in the distribution. (The movie data base ends in 2012)

### Name
This was the hardest column to sanitize and clean since a lot of variation of a same name are possible. We ended by defining a regex expression do define what we would accept as a valid name : ^[A-Z-\s\']+$

This allows us to limit ourselves to names composed only of capitalized letters, spaces, '-' for composed names and ''' for the some regional variations. This rule is really strict and would have made us lose a considerable proportion of our dataset. This is where the data cleaning process came to help homogenize our data and it mainly consisted of the following operations:

- Converting all the name to uppercase
- Removing all accents on letter, for example é becomes e.

Some names have different spellings, for example you can write JEREMY and JEREMIE, but we decided to count this as two separate entries since grouping "similar" is out of the scope of this project and is not an uniformised concept.

### Sex
The french dataset had some integer values that we converted to the expected format.

### Validation

TODO

## Demo

Here, we will import and clean the data base to demonstrate the process.

In [3]:
import src.data.names_data as NamesData
ukNames = NamesData.UKNamesData("UK", "ukbabynames_datasets/ukbabynames.csv")

# The raw data directly from the file
ukNames.raw_df.head()

UK : loaded 565817 rows !

     year sex     name       n  rank           nation
0  1996.0   F   SOPHIE  7087.0   1.0  England & Wales
1  1996.0   F    CHLOE  6824.0   2.0  England & Wales
2  1996.0   F  JESSICA  6711.0   3.0  England & Wales
3  1996.0   F    EMILY  6415.0   4.0  England & Wales
4  1996.0   F   LAUREN  6299.0   5.0  England & Wales

In [4]:
# We can call the cleaning method, which will correct the columns' names and ordering, and clean the content
ukNames.clean_raw_data()
ukNames().head() #  This is the cleaned data

   Year    Name Sex  Count
0  1974   AALIA   F      1
1  1974   AAMIR   M      1
2  1974   AARON   M     17
3  1974  ABADAH   F      1
4  1974   ABBEY   F      1

In [7]:
frenchNames = NamesData.FranceNamesData("France", "france.csv", "https://www.insee.fr/fr/statistiques/8205621?sommaire=8205628#dictionnaire", ";")

frenchNames.raw_df.head()

France : loaded 3884324 rows !

   sexe  preusuel annais dpt  nombre
0     1         A   XXXX  XX      27
1     1     AADAM   XXXX  XX      38
2     1     AADEL   XXXX  XX      56
3     1  AADHIRAN   2023  93       5
4     1  AADHIRAN   XXXX  XX      15

In [8]:
frenchNames.clean_raw_data()
frenchNames().head()

   Year              Name Sex  Count
0  1900              ABEL   M    382
1  1900        MARIE-ANNE   F     42
2  1900  MARIE-ANTOINETTE   F     61
3  1900     MARIE-EUGENIE   F      3
4  1900   MARIE-FRANCOISE   F     20

In [10]:
USNames = NamesData.USNamesData("US", "babyNamesUSYOB-full.csv")

USNames.raw_df.head()

US : loaded 1858689 rows !

   YearOfBirth       Name Sex  Number
0         1880       Mary   F    7065
1         1880       Anna   F    2604
2         1880       Emma   F    2003
3         1880  Elizabeth   F    1939
4         1880     Minnie   F    1746

In [12]:
USNames.clean_raw_data()
USNames().head()

   Year       Name Sex  Count
0  1880       MARY   F   7065
1  1880       ANNA   F   2604
2  1880       EMMA   F   2003
3  1880  ELIZABETH   F   1939
4  1880     MINNIE   F   1746